TYPES = {
  "target_proprety": {
    "ultimate": "Ultima Thule",
    "global": "Глобальная",
  },
  "priority": {
    "low": "Низкий",
    "medium": "Средний",
    "high": "Высокий",
    "important": "Максимальный"
  },
  "target_type": {
    "general": "Задача",
    "routine": "Рутина",
    "creative": "Творчество",
    "puzzle": "Головоломка",
    "physical": "Физическая нагрузка",
    "contact": "Контакт"
  },
  "task_status": {
    "process": "В процессе",
    "done": "Выполнено",
    "failed": "Провалено",
    "canceled": "Отменено"
  },
  "area": {
    "programming_language": "Язык программирования",
    "technology": "Технология", # Инструмент управления технологией
    "science": "Наука", # Область
    "paradigm": "Парадигма",
    "method": "Метод",
    "Framework": "Фреймворк",
    "library": "Библиотека",
    "language": "Язык",
    "other": "Другое",
  },
  "comprehension": {
    "unknown": "Неизвестно",
    "0": "0",
    "some": "Некоторое",
    "volume": "Объёмное",
    "full": "Полное",
  },
  "grade": {
    "0": "0",
    "beginner": "Базовый",
    "middle": "Средний",
    "advanced": "Продвинутый"
  },
  "errors": {
    "knowledge": "Недостаток знаний",
    "experience": "Недостаток опыта",
    "inattention": "Недостаток внимания/концентрация",
    "perception": "Ошибка в рамках восприятия/интерпретации данных/сигналов",
    "observation": "Ошибка в рамках наблюдения",
    "over_focus": "Чрезмерная фокусировка",
    "distraction": "Отвлеченность",
    "logic": "Логическая ошибка",
    "cognitive_bias": "Предвзятость/стереотипное мышление.",
    "heuristic": "Упрощённый метод",
    "over_generalization": "Чрезмерное обобщение",
    "memory": "Ошибка в рамках памяти",
    "false_memory": "Искажение памяти",
    "concept": "Непонимание концепции",
    "misconception": "Ложное понимание",
    "arithmetic": "Арифметическая ошибка",
    "strategy": "Стратегическая ошибка",
    "tactic": "Тактическая ошибка",
    "optimization": "Ошибка в рамках оптимизации",
    "management": "Ошибка при управлении",
    "resource_allocation": "Ошибка распределения",
    "precision": "Ошибка в точности",
    "technical": "Использование неисправной техники",
    "reaction": "Ошибка в рамках реакции",
    "overconfidence": "Чрезмерная уверенность",
    "decision-making": "Неверный выбор",
    "context": "Контекстуальная ошибка",
    "environmental": "Ошибка в рамках окружения",
    "motivation": "Ошибка в рамках мотивации",
    "emotional": "Ошибка в рамках эмоций",
    "learning": "Ошибка в рамках познания",
    "adaptation": "Адаптационная ошибка",
    "rule": "Нарушение внешних правил",
    "random": "Ошибка в рамках случайности",
    "fatigue": "Ошибка в рамках истощения",
    "relationship": "Ошибка в рамках сотрудничества",
    "trust": "Ошибка в рамках доверия",
    "connection": "Ошибка в рамках переговоров",
    "ethical": "Этическая ошибка",
    "cultural": "Ошибка в рамках культуры"
  },
  "knowledge": {
    "concept": "Понимание концепции",
    "knowledge": "Новое знание",
    "skill": "Улучшение навыка",
    "experience": "Новый опыт",
    "physical": "Физическая нагрузка",
    "loot": "Приобретение новых ресурсов",
    "status": "Новый социальный статус",
    "relationship": "Улучшение связи"
  },
  "domain_status": {
    "unavailable": "Недоступен",
    "available": "Доступен"
  },
}