TYPES = {
  "tasks": {
    "general": "Задача",
    "creative": "Творчество",
    "puzzle": "Головоломка",
    "physical": "Физическая нагрузка",
    "contact": "Контакт"
  },
  "errors": {
    "knowledge": "Недостаток знаний",
    "experience": "Недостаток опыта",
    "inattention": "Недостаток внимания/концентрация",
    "perception": "Ошибка в рамках восприятия/интерпретации данных/сигналов",
    "observation": "Ошибка в рамках наблюдения",
    "over_focus": "Чрезмерная фокусировка",
    "distraction": "Отвлеченность",
    "logic": "Логическая ошибка",
    "cognitive_bias": "Предвзятость/стереотипное мышление.",
    "heuristic": "Упрощённый метод",
    "over_generalization": "Чрезмерное обобщение",
    "memory": "Ошибка в рамках памяти",
    "false_memory": "Искажение памяти",
    "concept": "Непонимание концепции",
    "misconception": "Ложное понимание",
    "arithmetic": "Арифметическая ошибка",
    "strategy": "Стратегическая ошибка",
    "tactic": "Тактическая ошибка",
    "optimization": "Ошибка в рамках оптимизации",
    "management": "Ошибка при управлении",
    "resource_allocation": "Ошибка распределения",
    "precision": "Ошибка в точности",
    "technical": "Использование неисправной техники",
    "reaction": "Ошибка в рамках реакции",
    "overconfidence": "Чрезмерная уверенность",
    "decision-making": "Неверный выбор",
    "context": "Контекстуальная ошибка",
    "environmental": "Ошибка в рамках окружения",
    "motivation": "Ошибка в рамках мотивации",
    "emotional": "Ошибка в рамках эмоций",
    "learning": "Ошибка в рамках познания",
    "adaptation": "Адаптационная ошибка",
    "rule": "Нарушение внешних правил",
    "random": "Ошибка в рамках случайности",
    "fatigue": "Ошибка в рамках истощения",
    "relationship": "Ошибка в рамках сотрудничества",
    "trust": "Ошибка в рамках доверия",
    "connection": "Ошибка в рамках переговоров",
    "ethical": "Этическая ошибка",
    "cultural": "Ошибка в рамках культуры"
  },
  "problems": {
    "concept": "Непонимание концепции",
    "knowledge": "Недостаток знания",
    "skill": "Недостаток навыка",
    "experience": "Недостаток опыта",
    "physical": "Недостаток физической силы",
    "loot": "Недостаток ресурсов",
    "status": "Недостаток социального статуса",
    "relationship": "Недостаток связей",
    "person": "Личная проблема",
    "information": "Недостаток конкретной информации"
  },
  "knowledge": {
    "concept": "Понимание концепции",
    "knowledge": "Новое знание",
    "skill": "Улучшение навыка",
    "experience": "Новый опыт",
    "physical": "Физическая нагрузка",
    "loot": "Приобретение новых ресурсов",
    "status": "Новый социальный статус",
    "relationship": "Улучшение связи"
  },
  "task_status": {
    "process": "В процессе",
    "done": "Выполнено",
    "failed": "Провалено"
  },
  "domain_status": {
    "unavailable": "Недоступен",
    "available": "Доступен"
  },
  "theory_level": {
    "0": "0",
    "1": "1",
    "2": "Углублённое понимание",
    "3": "Широкое углублённое понимание"
  }
}